{
  "jobs": [
    {
      "id": "1",
      "title": "Junior React Developer",
      "type": "Full-Time",
      "description": "Join our growing React Developer team and work on cutting-edge applications with expertise in React, Redux, and JavaScript. We are looking for a Junior React Developer with 3-5 years of experience in React development and development tools for developers to develop applications that integrate with React and react components  and integrate with React components",
      "salary": "70K - 80K",
      "location": "Kakamega County",
      "company": {
        "name": "Safaricom",
        "description": "Safaricom is a leading technology company specializing in digital solutions for businesses of all sizes. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services. For more information about our products and services available on our website and in our website resources, please visit our website",
        "contactEmail": "masinde@techolutions.com",
        "contactPhone": "0712258858"
      }
    },
    {
      "id": "2",
      "title": "Mid-level React Developer",
      "type": "Full-Time",
      "description": "We are seeking a skilled Mid-level React Developer to join our team. The mid-level React Developer will be responsible for making React applications more efficient, scalable, and maintainable. The ideal candidate will have 5-7 years",
      "salary": "100K - 120K",
      "location": "Nairobi",
      "company": {
        "name": "Telescope",
        "description": "Telescope is a leading technology company specializing in cutting-edge software solutions for businesses. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services to customers across the world and providing customers with a variety of technologies available to customers across the world",
        "contactEmail": "masinde@techolutions.com",
        "contactPhone": "0712258858"
      }
    },
    {
      "id": "3",
      "title": "Mid-level React Developer",
      "type": "Remote",
      "description": "Looking for a Mid-level React Developer with 2 years of experience in React, Redux, and JavaScript. The ideal candidate will have a strong understanding of React hooks, components and components that are reusable. Your role will ",
      "salary": "100K - 120K",
      "location": "Nairobi",
      "company": {
        "name": "Meta",
        "description": "Meta is a leading technology company specializing in cutting-edge software solutions for businesses. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services.",
        "contactEmail": "masinde@techolutions.com",
        "contactPhone": "0712258858"
      }
    },
    {
      "id": "4",
      "title": "Junior React Developer",
      "type": "Remote",
      "description": "Looking for a Junior React Developer with 2 years of experience in React, Redux, and JavaScript. The ideal candidate will have a strong understanding of React hooks, components and components that are reusable.",
      "salary": "100K - 120K",
      "location": "Nairobi",
      "company": {
        "name": "Microsoft Corporation",
        "description": "Microsoft Corporation is a leading technology company specializing in cutting-edge software solutions for businesses and business applications that provide customers with opportunity to develop products  and services",
        "contactEmail": "masinde@techolutions.com",
        "contactPhone": "0712258858"
      }
    },
    {
      "id": "5",
      "title": "Internship React Developer",
      "type": "Full-Time",
      "description": "Looking for a Mid-level React Developer with 0-2 years of experience...",
      "salary": "120K - 150K",
      "location": "Nairobi",
      "company": {
        "name": "Tesla",
        "description": "Tesla is a leading technology company specializing in cutting-edge software solutions for businesses. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services.",
        "contactEmail": "masinde@techolutions.com",
        "contactPhone": "0712258858"
      }
    },
    {
      "id": "6",
      "title": "Sinior React Developer",
      "type": "Full-Time",
      "description": "Looking for a Senior React Developer with 10+ years of experience...",
      "salary": "150K - 200K",
      "location": "Nairobi",
      "company": {
        "name": "Google",
        "description": "Google is a leading technology company specializing in cutting-edge software solutions for businesses.  With a focus on innovation and customer satisfaction, we are committed to delivering cutting- edge products and services.",
        "contactEmail": "masinde@techolutions.com",
        "contactPhone": "0712258858"
      }
    },
    {
      "id": "254d",
      "title": "Full Stack Developer",
      "location": "Nyero",
      "description": "Ability to write code leveraging language features / framework features\nGeneral understanding of system architecture and tiered development\nMaintaining coding standards and participate in peer code reviews\nUse multiple tools to help debug / troubleshoot issues\nEnsure software is well tested including implementation of unit and integration tests\nCreate solutions to business problems\nUse analysis and critical thinking skills to determine the best approach to a software solution\nKey Competencies / Skills\n\nProficient in 1 or many of the following: o JavaScript, Java, Python, Node.js, .NET, Angular, React, Express, SQL\nUnderstand database features: o Model relational database schemas to support business requirements\nAuthor SQL statement for CRUD operations\nDebug and analyse SQL Statement for optimization\nExperience working with source code repositories\nUnderstand cloud services and implementation\nExemplary communication (written, oral) and interpersonal skills\nExcellent coding abilities to work on numerous parts of a system or application at the same time while being accurate and thorough\nCritical thinking to identify risks and enhance problem solving\nFlexibility to adjust to clients changing request\nAbility to learn quickly and work independently or as part of a team\nExposure to the Agile and Scrum development methodologies\nRequired Qualifications & Experience\n\nBachelor's degree in computer science or related field\n3+ years of experience in software development\nStrong analytical, problem-solving skills and attention to detail\nSupport clients in the US\nRelocate to Nyeri, Kenya\n\nMethod of ApplicationInterested and qualified? Go to TheJitu.com on www.linkedin.com to apply\n",
      "type": "Remote",
      "salary": "100K - 125K",
      "company": {
        "name": "TheJitu.com",
        "description": "The Jitu is a software and technology provider based in Nyeri, Kenya. We chose Nyeri because we believe the talent in this area of the world can compete globally. If you would like to work for a company that believes in Nyeri and plans to be a GIANT globally then please apply for an opening with us. One of the foundations of The Jitu is we hire based on talent and we promote based on the individual's ability to deliver quality solutions. We do not care which tribe you are from or if you are male or female",
        "contactEmail": "job.contactEmail@gmail.com",
        "contactPhone": "0712250058"
      }
    }
  ]
}